

// console.log("Просьба оценку сразу не ставить, знаю что отстаю от графика, постораюсь доделать  к сроку дедлайна по проверки задания");
console.log(`Ваша оценка - 102 балла 
Отзыв по пунктам ТЗ:
Не выполненные/не засчитанные пункты:
1) 

2) 

3) при нажатии на бургер-иконку меню появляется, плавно выдвигаясь слева, бургер-иконка изменяется на крестик. При нажатии на крестик меню исчезает, плавно возвращаясь назад, иконка крестика превращается в бургер-иконку 

4) ссылки в меню работают, обеспечивая плавную прокрутку по якорям 

5) при клике по ссылке в адаптивном меню, или при клике по любому месту сайта, кроме самого адаптивного меню, меню закрывается 

6) вёрстка меню соответствует макету на всех проверяемых разрешениях 

Частично выполненные пункты:


1) Блок header 

2) Секция Tickets 

3) Форма покупки билетов 

4) Секция Contacts 

5) Блок footer  

6) Блок header 

7) Секция Video 

8) Секция Gallery 

9) Секция Tickets 

10) Секция Contacts 

11) Блок footer  

12) Блок header 

13) Секция Welcome 

14) Секция Visiting 

15) Секция Explore 

16) Секция Video 

17) Секция Gallery 

18) Секция Tickets 

19) Секция Contacts 

Выполненные пункты:
1) Секция Welcome 

2) Секция Visiting 

3) Секция Explore 

4) Секция Video 

5) Секция Gallery 

6) Секция Welcome 

7) Секция Visiting 

8) Секция Explore 

9) Блок footer  

10) Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки,  элементы не должны скрываться, обрезаться, наезжать друг на друга, если это не предусмотрено макетом. 

11) слайдера в секции 'Welcome' 

12) слайдера сравнения изображений в секции 'Explore' 

13) кастомного видеоплеера в секции Video' 

14) слайдера в секции Video

15) YouTube-видео в плейлисте в секции Video, маленькие видео выровнены по краям большого 

16) галереи изображений и изображений в ней 

17) карты 

18) Результат проверки скорости сайта для мобильных устройств: 0 to 49 (red): Poor - не выполнено 0 ,баллов; 50 to 89 (orange): Needs Improvement - частично выполнено - 4 баллов; 90 to 100 (green): Good - выполнено полностью - 8 баллов 

`);
